xml4test/withIdHashSigCert4.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1">   <S:Body>      <ns2:SendRequestRequest xmlns:ns3="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/faults/1.1" xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">         <ns:SenderProvidedRequestData Id="SIGNED_BY_CONSUMER" xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">	<ns:MessageID>a05f1d49-70a6-11e8-8162-5fa2da75ab91</ns:MessageID><ns2:MessagePrimaryContent><ns1:BreachRequest xmlns:ns1="urn://x-artefacts-gibdd-gov-ru/breach/root/1.0"  xmlns:ns2="urn://x-artefacts-gibdd-gov-ru/breach/commons/1.0"  xmlns:ns3="urn://x-artefacts-smev-gov-ru/supplementary/commons/1.0.1" Id="PERSONAL_SIGNATURE"> <ns1:RequestedInformation> <ns2:RegPointNum>Т785ЕС57</ns2:RegPointNum> </ns1:RequestedInformation> <ns1:Governance> <ns2:Name>ГИБДД РФ</ns2:Name> <ns2:Code>GIBDD</ns2:Code> <ns2:OfficialPerson> <ns3:FamilyName>Загурский</ns3:FamilyName> <ns3:FirstName>Андрей</ns3:FirstName> <ns3:Patronymic>Петрович</ns3:Patronymic> </ns2:OfficialPerson></ns1:Governance> </ns1:BreachRequest> </ns2:MessagePrimaryContent>	<ns:TestMessage/></ns:SenderProvidedRequestData>         <ns2:CallerInformationSystemSignature><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/><ds:Reference URI="#SIGNED_BY_CONSUMER"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:Transform Algorithm="urn://smev-gov-ru/xmldsig/transform"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/><ds:DigestValue>/jXl70XwnttJB5sSokwh8SaVHwo2gjgILSu0qBaLUAo=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>q8Lgk5vNWbnU9FkvgLLnyd5GNDSur9/ZCo9MIwE9fDJ5h/cxJYYidoGyQ82u6kgwfd1Jf2qjT9wlE2bxgKeKXA==</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIICGTCCAcigAwIBAgIBATAIBgYqhQMCAgMwRzEOMAwGA1UEBhMFQ08uVUsxFTATBgNVBAoTDEluY29ycG9yYXRlZDEPMA0GA1UECxMGUm9sYW5kMQ0wCwYDVQQDEwRSb290MB4XDTE4MDYxNTE0MTU1OVoXDTE5MDYxNTAwMDAwMFowUzEOMAwGA1UEBhMF
Q08uVUsxFTATBgNVBAoTDEluY29ycG9yYXRlZDEPMA0GA1UECxMGUm9sYW5kMRkwFwYDVQQDExBSb21hbiBQYXN0dXNoa292MGMwHAYGKoUDAgITMBIGByqFAwICIwEGByqFAwICHgEDQwAEQJuf64Osxi9akQR+WpxT9KlqqT9Pc373GARBBnZR6IsIVS+Y
aJfgVKolrH1b7V2kBBrdxq/BWcw4P+Szu2Fe3H6jgZAwgY0wDwYDVR0TAQH/BAUwAwEB/zAOBgNVHQ8BAf8EBAMCAYYwKgYDVR0lAQH/BCAwHgYIKwYBBQUHAwkGCCsG
AQUFBwMIBggrBgEFBQcDAzAdBgNVHQ4EFgQUAgZhttEpR8qjUSayMtj20qUFwWwwHwYDVR0jBBgwFoAUfBygEicjIRrKjmVZuKJ7nDCaOhwwCAYGKoUDAgIDA0EAwII2
xr8u2g/W1U5Rd6uMejIwyJSjNJgxgJaErLETJ3awXmWYKHFUdpWKNYDbqy5LhljG4CGwNcbfQBHLFrT7lQ==</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature></ns2:CallerInformationSystemSignature>      </ns2:SendRequestRequest>   </S:Body></S:Envelope>
